Autodesk.Navisworks.Api.SheetType
Determines which type the sheet is

Autodesk.Navisworks.Api.SheetType.Sheet3D
Sheet contains a 3D model

Autodesk.Navisworks.Api.SheetType.Sheet2D
Sheet contains a 2D model (plot)